<a href="https://colab.research.google.com/github/kvneswar/PythonForDSAndMLBootcamp/blob/main/05_Pandas_py.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np
import pandas as pd

In [4]:
lables = ['a', 'b', 'c']

my_data = [10, 20, 30]

arr = np.array(my_data)

d = {'a': 10, 'b': 20, 'c':30}

Series

In [10]:
print(pd.Series(data = my_data))

print(pd.Series(data = my_data, index=lables))

print(pd.Series(data = arr, index=lables))

print(pd.Series(d))

0    10
1    20
2    30
dtype: int64
a    10
b    20
c    30
dtype: int64
a    10
b    20
c    30
dtype: int64
a    10
b    20
c    30
dtype: int64

In [14]:
ser1 = pd.Series([1, 2, 3], ['India', 'USA', 'China'])
ser2 = pd.Series([1, 2, 4], ['India', 'USA', 'Italy'])

print(ser1)

print(ser1['India'])

#Performs the mathematical operations based on the index, if the common index not found then null/Nan will be returned
print(ser1 + ser2)
print(ser1 - ser2)

India    1
USA      2
China    3
dtype: int64
1
China    NaN
India    2.0
Italy    NaN
USA      4.0
dtype: float64
China    NaN
India    0.0
Italy    NaN
USA      0.0
dtype: float64

Data Frames

In [53]:
dataFrame1 = pd.DataFrame([['John', 20], ['Jane', 25], ['Mike', 30], ['Emily', 35]])

print(dataFrame1)

dataFrame1_1 = pd.DataFrame(data = [['John', 20], ['Jane', 25], ['Mike', 30], ['Emily', 35]], 
                            index = ['Person1', 'Person2', 'Person3', 'Person4'], 
                            columns = ['Name', 'Age'])

print(dataFrame1_1)

dataFrame2 = pd.DataFrame({'Name': ['John', 'Jane', 'Mike', 'Emily'], 
                           'age': [20, 25, 30, 35],
                           'city': ['NewYork', 'London', 'Paris', 'Sydney']})
print(dataFrame2)

dataFrame3 = pd.DataFrame({'Name': ['John', 'Jane', 'Mike', 'Emily'], 
                           'age': [20, 25, 30, 35],
                           'city': ['NewYork', 'London', 'Paris', 'Sydney']},
                          ['person1', 'person2', 'person3', 'person4'])
print(dataFrame3)

#Each column in a data frame is SERIES

print(type(dataFrame3['Name']))
print(dataFrame3['Name']['person1'])

print(dataFrame3[['Name', 'age']])

       0   1
0   John  20
1   Jane  25
2   Mike  30
3  Emily  35
          Name  Age
Person1   John   20
Person2   Jane   25
Person3   Mike   30
Person4  Emily   35
    Name  age     city
0   John   20  NewYork
1   Jane   25   London
2   Mike   30    Paris
3  Emily   35   Sydney
          Name  age     city
person1   John   20  NewYork
person2   Jane   25   London
person3   Mike   30    Paris
person4  Emily   35   Sydney
<class 'pandas.core.series.Series'>
John
          Name  age
person1   John   20
person2   Jane   25
person3   Mike   30
person4  Emily   35

In [54]:
dataFrame3['newColumn'] = dataFrame3['age'] + dataFrame3['age']

print(dataFrame3)

dataFrame3 = dataFrame3.drop('newColumn', axis = 1) #set inPlace=true to update the data structure

print(dataFrame3)

#drop a row

dataFrame3.drop('person4', axis=0, inplace=True)

print(dataFrame3)

#to get the dimensions of the array

print(dataFrame3.shape)

          Name  age     city  newColumn
person1   John   20  NewYork         40
person2   Jane   25   London         50
person3   Mike   30    Paris         60
person4  Emily   35   Sydney         70
          Name  age     city
person1   John   20  NewYork
person2   Jane   25   London
person3   Mike   30    Paris
person4  Emily   35   Sydney
         Name  age     city
person1  John   20  NewYork
person2  Jane   25   London
person3  Mike   30    Paris
(3, 3)